app/controllers/homes_controller.rb

  def contact
    if request.post? and params[:contact]
      if contact = Contact.new(params[:contact])
        contact.name = "#{params[:contact][:name]}"
        contact.email = "#{params[:contact][:email]}"
        contact.message = "#{params[:contact][:message]}"

        if contact.save
---
INSERT INTO `contacts` (`name`, `email`, `message`, `created_at`, `updated_at`) VALUES ('priti', 'priti@gmail.com', 'hoiiiiiiiiiiiiiiiiiiiiiiiiiiiiiii', '2012-08-14 10:06:29', '2012-08-14 10:06:29')