app/controllers/users_controller.rb

  def create
     @user = User.new(params[:user])
     if @user.save
---
INSERT INTO `users` (`email`, `password_hash`, `password_salt`, `created_at`, `updated_at`) VALUES ('deepak@gmail.com', '$2a$10$TN08DLzDqLTs8tT2jmCa3uA4AqI0Y1kXyV.s8M5LNJIcSuP8fP.DS', '$2a$10$TN08DLzDqLTs8tT2jmCa3u', '2012-08-14 10:21:06', '2012-08-14 10:21:06')

   def show_profile
    @user = current_user.profile if current_user.present?
---
SELECT `profiles`.* FROM `profiles` WHERE (`profiles`.user_id = 1) LIMIT 1

   def profile
    user = current_user
    profile = user.build_profile(params[:profile])
    if profile.save
---
INSERT INTO `profiles` (`user_id`, `fname`, `lname`, `gender`, `dob`, `country`, `state`, `city`, `address`, `pin`, `phone`, `image`, `created_at`, `updated_at`) VALUES (1, 'Deepak', 'Sakure', 'Male', '1989-10-14', 'india', 'Mah', 'Nagpur', 'chinchbhavan', 441108, 8087149190, NULL, '2012-08-14 13:07:42', '2012-08-14 13:07:42')